Repository: yj9294/BPDeliever
Catalog: BPDeliverer/*.lproj/Localizable.strings
Languages: ar

source: tracker
ar: تعقب

source: add
ar: معدل

# analytics
source: version
ar: إصدار

source: profile
ar: حساب تعريفي

source: Record blood pressure status
ar: تسجيل حالة ضغط الدم

source: Add
ar: أضف

source: Low BP
ar: ضغط منخفض

source: Normal BP
ar: ضغط ضغط عادي

source: Elevated BP
ar: ارتفاع ضغط الدم

source: Severe hypertension
ar: ارتفاع ضغط الدم الشديد

source: Tip
ar: نصيحة

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Are you sure you want to delete this record？
ar: هل أنت متأكد أنك تريد حذف هذا السجل؟

source: Details
ar: التفاصيل

source: New Measurement
ar: قياس جديد

source: Continue
ar: متابعة

source: Edit
ar: تحرير

source: Range: %@
ar: النطاق: %@

source: Feeling
ar: الشعور

source: Measured arm
ar: الذراع المقاسة

source: Body Position
ar: وضعية الجسم

source: Note
ar: ملاحظة

source: Mabel Figueroa Hattie Fitzgerald Nancy Ball Mabel Figueroa
ar: مابيل فيغيروا هاتي فيتزجيرالد نانسي بول مابيل فيغيروا

source: OK
ar: موافق

source: Analytics Data
ar: بيانات التحليلات

source: The proportion of normal blood pressure values
ar: نسبة قيم ضغط الدم الطبيعية

source: BP Trends
ar: اتجاهات بي بي

source: MAP Trends
ar: اتجاهات الخريطة

source: Heart Rate
ar: معدل ضربات القلب

source: is the proportion of normal blood pressure values
ar: هي نسبة قيم ضغط الدم الطبيعية

source: Days
ar: أيام

source: Your Average BP
ar: متوسط ضغط الدم لديك

source: Your Average HR
ar: متوسط الموارد البشرية لديك

source: The normal range 120-80 mmHg
ar: النطاق الطبيعي 120-80 مم زئبق

source: The normal range 79-110 mmHg
ar: النطاق الطبيعي 79-110 مم زئبق

source: Daily reminder
ar: التذكير اليومي

source: Privacy policy
ar: سياسة الخصوصية

source: Language
ar: اللغة

source: Contact us
ar: اتصل بنا

source: English
ar: الإنجليزية

source: Portuguese
ar: البرتغالية

source: French
ar: الفرنسية

source: Spanish
ar: الإسبانية

source: German
ar: الألمانية

source: Arabic
ar: العربية

source: Selection period
ar: فترة الاختيار

source: Record your blood pressure status and analyze your health status!
ar: سجل حالة ضغط الدم لديك وقم بتحليل حالتك الصحية!

# privacy
source: Please read this privacy policy in detail. This Privacy Policy is intended to inform you about the personal data we collect from you. We will use and protect your personal information through formal means and we will legally share your personal information. What information will we collect We may collect information you provide when registering, using the application, or contacting us, including but not limited to: Your blood pressure data and other health-related information. At the same time, our app will also automatically collect this information, including but not limited to: Equipment information (model, operating system version, etc.) Application usage statistics IP address Application crash report How we use your information The information we collect will be used for the following purposes: 1. Provide, maintain, and improve the functionality and services of the application 2. Send notifications and updates related to the application 3. Handle user requests or provide customer support 4. Improve user experience How will we share your information We promise not to sell, exchange, or transfer your personal information to third parties, except in the following situations: with your consent, in accordance with legal provisions or compliance requirements, to protect our rights, property, or security. About children's privacy We promise that our apps and services are only applicable to people aged 17 and above. If we become aware that children under the age of 17 have provided us with personal information, we will immediately delete that information from the server. If you are a parent or guardian and know that your child has provided us with personal information, please contact us. Update We may update this Privacy Policy on this page. Contact us ming1997317@outlook.com
ar: يرجى قراءة سياسة الخصوصية هذه بالتفصيل. تهدف سياسة الخصوصية هذه إلى إعلامك بالبيانات الشخصية التي نجمعها منك. سنستخدم معلوماتك الشخصية ونحميها من خلال الوسائل الرسمية وسنشارك معلوماتك الشخصية بشكل قانوني. ما هي المعلومات التي سوف نقوم بجمعها قد نقوم بجمع المعلومات التي تقدمها عند التسجيل أو استخدام التطبيق أو الاتصال بنا، بما في ذلك على سبيل المثال لا الحصر: بيانات ضغط الدم وغيرها من المعلومات المتعلقة بالصحة. وفي الوقت نفسه، سيقوم تطبيقنا أيضًا بجمع هذه المعلومات تلقائيًا، بما في ذلك على سبيل المثال لا الحصر: معلومات الجهاز (الطراز، إصدار نظام التشغيل، إلخ.) إحصائيات استخدام التطبيق عنوان IP تقرير تعطل التطبيق كيف نستخدم معلوماتك سيتم استخدام المعلومات التي نجمعها للأغراض التالية: 1. توفير وظائف وخدمات التطبيق وصيانتها وتحسينها 2. إرسال الإشعارات والتحديثات المتعلقة بالتطبيق 3. التعامل مع طلبات المستخدم أو تقديم دعم العملاء 4. تحسين تجربة المستخدم كيف سنشارك معلوماتك نعد بعدم بيع معلوماتك الشخصية أو تبادلها أو نقلها إلى أطراف ثالثة، إلا في الحالات التالية: بموافقتك، وفقًا للأحكام القانونية أو متطلبات الامتثال، لحماية حقوقنا أو ممتلكاتنا أو أمننا. حول خصوصية الأطفال نحن نعد بأن تطبيقاتنا وخدماتنا تنطبق فقط على الأشخاص الذين تبلغ أعمارهم 17 عامًا فما فوق. إذا علمنا أن الأطفال الذين تقل أعمارهم عن 17 عامًا قد زودونا بمعلومات شخصية، فسنحذف هذه المعلومات على الفور من الخادم. إذا كنت أحد الوالدين أو الوصي وتعلم أن طفلك قد زودنا بمعلومات شخصية، فيرجى الاتصال بنا. تحديث قد نقوم بتحديث سياسة الخصوصية هذه على هذه الصفحة. اتصل بنا ming1997317@outlook.com شروط الاستخدام استخدام التطبيق 1. أنت توافق على أننا سنستخدم معلوماتك للأغراض التي تتطلبها القوانين واللوائح. 2. أنت تقر بأنه لا يجوز لك استخدام تطبيقنا لأغراض غير قانونية. 3. أنت توافق على أنه يجوز لنا التوقف عن تقديم منتجاتنا وخدماتنا في أي وقت دون إشعار مسبق. 4. بالموافقة على تنزيل برنامجنا أو تثبيته، فإنك توافق على سياسة الخصوصية الخاصة بنا. تحديث قد نقوم بتحديث سياسة الخصوصية هذه على هذه الصفحة. اتصل بنا ming1997317@outlook.com

# basic
source: Importance of blood pressure Blood pressure is one of the most important measures of circulatory health and is essential for overall body function and proper functioning of the cardiovascular system. Here's how important blood pressure is: 1. Cardiovascular health: Blood pressure reflects how hard the heart pumps and blood flows through the blood vessels. Normal blood pressure helps keep the cardiovascular system healthy, reducing the burden on the heart and reducing the risk of heart disease and stroke. 2. Circulatory system balance: A normal level of blood pressure helps to maintain the balance of blood between the arteries and veins, ensuring adequate supply of oxygen and nutrients to the various tissues and organs of the body. 3. Kidney function: Blood pressure maintained within the normal range helps protect the kidneys. High blood pressure can lead to kidney damage, while normal blood pressure helps maintain the normal filtering function of the glomeruli. 4. Prevention of cardiovascular disease: High blood pressure is one of the main risk factors for cardiovascular disease. By controlling blood pressure, you can effectively prevent heart disease, stroke and other related diseases. 5. Quality of life: Maintaining normal blood pressure levels helps improve quality of life. Normal blood pressure makes it easier to stay energized and focused, and to avoid unpleasant symptoms such as fatigue and headaches. 6. Early warning system: Blood pressure measurement can act as an early warning system to help detect potential problems in the body. By monitoring blood pressure regularly, problems such as high blood pressure can be detected and intervened early to prevent them. To sum up, maintaining normal blood pressure is a key factor in maintaining overall health and preventing multiple chronic diseases. Proper blood pressure levels can be effectively managed and maintained through a healthy lifestyle and regular medical checkups. Sources of information for the article: 1. https://www.jacc.org/doi/10.1016/S0735-1097%2802%2981088-9 2. https://www.jacc.org/doi/10.1016/j.jacasi.2023.02.001
ar: يعد ارتفاع ضغط الدم مشكلة صحية شائعة ولكنها قد تكون خطيرة. إن الفهم الشامل لأساسيات ارتفاع ضغط الدم أمر ضروري للوقاية والإدارة. ستقدم هذهأهمية ضغط الدم يعد ضغط الدم أحد أهم مقاييس صحة الدورة الدموية وهو ضروري لوظيفة الجسم بشكل عام والأداء السليم لنظام القلب والأوعية الدموية. وإليك مدى أهمية ضغط الدم: 1. صحة القلب والأوعية الدموية: يعكس ضغط الدم مدى قوة القلب المضخات ويتدفق الدم عبر الأوعية الدموية. ضغط الدم الطبيعي يساعد في الحفاظ على صحة نظام القلب والأوعية الدموية، مما يقلل العبء على القلب القلب وتقليل خطر الإصابة بأمراض القلب والسكتة الدماغية. 2. توازن الدورة الدموية: يساعد المستوى الطبيعي لضغط الدم على الحفاظ على توازن الدم بين الشرايين والأوردة، مما يضمن وصول الأكسجين والمواد المغذية الكافية إلى أنسجة وأعضاء الجسم المختلفة. 3. وظائف الكلى: الحفاظ على ضغط الدم ضمن المعدل الطبيعي يساعد على حماية الكلى. يمكن أن يؤدي ارتفاع ضغط الدم إلى تلف الكلى، بينما يساعد ضغط الدم الطبيعي في الحفاظ على وظيفة الترشيح الطبيعية للكبيبات. 4. الوقاية من أمراض القلب والأوعية الدموية: يعد ارتفاع ضغط الدم أحد عوامل الخطر الرئيسية للإصابة بأمراض القلب والأوعية الدموية. من خلال التحكم في ضغط الدم، يمكنك الوقاية بشكل فعال من أمراض القلب والسكتة الدماغية والأمراض الأخرى ذات الصلة. 5. نوعية الحياة: الحفاظ على مستويات ضغط الدم الطبيعية يساعد على تحسين نوعية الحياة. إن ضغط الدم الطبيعي يجعل من السهل الحفاظ على النشاط والتركيز، وتجنب الأعراض غير السارة مثل التعب والصداع. 6. نظام الإنذار المبكر: قياس ضغط الدم يمكن أن يكون بمثابة نظام إنذار مبكر للمساعدة في اكتشاف المشاكل المحتملة في الجسم. ومن خلال مراقبة ضغط الدم بانتظام، يمكن اكتشاف مشاكل مثل ارتفاع ضغط الدم والتدخل المبكر للوقاية منها. خلاصة القول، الحفاظ على ضغط الدم الطبيعي هو عامل رئيسي في الحفاظ على الصحة العامة والوقاية من الأمراض المزمنة المتعددة. يمكن إدارة مستويات ضغط الدم المناسبة والحفاظ عليها بشكل فعال من خلال نمط حياة صحي وفحوصات طبية منتظمة. مصادر المعلومات للمقال: 1. https://www.jacc.org/doi/10.1016/S0735-1097%2802%2981088-9 2. https://www.jacc.org/doi/10.1016/j.jacasi.2023.02.001

# balance
source: Diet and blood pressure management Diet plays a key role in blood pressure management. Adopting a healthy diet can help control and maintain ideal blood pressure levels. Here are some dietary suggestions to help with blood pressure management: 1. Low salt diet: Controlling salt intake is an important step in maintaining healthy blood pressure. Too much sodium can cause water retention in the body and increase blood volume, which in turn raises blood pressure. The recommended daily salt intake is no more than 5 grams. 2. Eat more fruits and vegetables: Fruits and vegetables are naturally rich in potassium, magnesium and fiber, which help lower blood pressure. In particular, eating potassium-rich fruits, such as bananas, oranges, and strawberries, has a positive effect on maintaining electrolyte balance. 3. Get the right amount of protein: Choose low-fat protein sources such as fish, chicken, tofu, and beans. These foods help maintain a healthy weight and maintain blood pressure. 4. Low-fat diet: Choose foods that are low in fat and reduce your intake of saturated and trans fats. A low-fat diet can help control weight and reduce the burden on your heart. 5. Whole grains: Choose whole grain foods such as oats, brown rice, and whole wheat bread, which are high in fiber and nutrients that help maintain stable blood sugar levels and lower blood pressure. 6. Limit caffeine and alcohol: High caffeine and alcohol intake may increase blood pressure. Moderate your intake of coffee and wine, or consider choosing decaffeinated alternatives. 7. Control sugar: High sugar intake may be linked to high blood pressure. Avoid excessive consumption of sugar and processed foods and choose low-sugar and naturally sweet alternatives. 8. Drink enough water: Maintaining a good water balance is important for stable blood pressure. Make sure to drink enough water every day, especially during hot weather and after exercise. Please note that the above advice does not apply to everyone and individual differences exist. Before making any dietary adjustments, it is recommended to consult a doctor or professional health care provider for advice, especially for people with other chronic conditions. Sources of information for the article: 1. https://www.jacc.org/doi/10.1016/j.jacc.2012.09.010 2. https://www.jacc.org/doi/10.1016/j.jacc.2017.10.011
ar: النظام الغذائي وإدارة ضغط الدم يلعب النظام الغذائي دورًا رئيسيًا في إدارة ضغط الدم. يمكن أن يساعد اتباع نظام غذائي صحي في التحكم في مستويات ضغط الدم المثالية والحفاظ عليها. فيما يلي بعض الاقتراحات الغذائية للمساعدة في التحكم في ضغط الدم: 1. اتباع نظام غذائي منخفض الملح: يعد التحكم في تناول الملح خطوة مهمة في الحفاظ على ضغط دم صحي. أيضاً فالكثير من الصوديوم يمكن أن يسبب احتباس الماء في الجسم وزيادة حجم الدم، مما يؤدي بدوره إلى رفع ضغط الدم. الكمية اليومية الموصى بها من الملح لا تزيد عن 5 جرام. 2. تناول المزيد من الفواكه والخضروات: الفواكه والخضروات غنية بشكل طبيعي بالبوتاسيوم والمغنيسيوم والألياف، مما يساعد على خفض ضغط الدم. وعلى وجه الخصوص، فإن تناول الفواكه الغنية بالبوتاسيوم، مثل الموز والبرتقال والفراولة، له تأثير إيجابي على الحفاظ على توازن الإلكتروليت. 3. احصل على الكمية المناسبة من البروتين: اختر مصادر البروتين قليلة الدهون مثل الأسماك والدجاج والتوفو والفاصوليا. تساعد هذه الأطعمة في الحفاظ على وزن صحي والحفاظ على ضغط الدم. 4. نظام غذائي قليل الدهون: اختر الأطعمة قليلة الدهون وقلل من تناول الدهون المشبعة والمتحولة. يمكن أن يساعد اتباع نظام غذائي قليل الدهون في التحكم في الوزن وتقليل العبء على قلبك. 5. الحبوب الكاملة: اختر الأطعمة المصنوعة من الحبوب الكاملة مثل الشوفان والأرز البني وخبز القمح الكامل، فهي غنية بالألياف والمواد المغذية التي تساعد في الحفاظ على مستويات مستقرة للسكر في الدم وخفض ضغط الدم. 6. الحد من الكافيين والكحول: قد يؤدي تناول كميات كبيرة من الكافيين والكحول إلى زيادة ضغط الدم. اعتدال في تناول القهوة والنبيذ، أو فكر في اختيار البدائل الخالية من الكافيين. 7. السيطرة على السكر: قد يرتبط تناول السكر المرتفع بارتفاع ضغط الدم. تجنب الاستهلاك المفرط للسكر والأطعمة المصنعة واختر بدائل منخفضة السكر وحلوة بشكل طبيعي. 8. اشرب كمية كافية من الماء: الحفاظ على توازن جيد للمياه أمر مهم لاستقرار ضغط الدم. احرصي على شرب كمية كافية من الماء يومياً، خاصة أثناء الطقس الحار وبعد ممارسة التمارين الرياضية. يرجى ملاحظة أن النصيحة المذكورة أعلاه لا تنطبق على الجميع وهناك فروق فردية. قبل إجراء أي تعديلات غذائية، يوصى باستشارة الطبيب أو مقدم الرعاية الصحية المحترف للحصول على المشورة، خاصة للأشخاص الذين يعانون من أمراض مزمنة أخرى. مصادر المعلومات للمقال: 1. https://www.jacc.org/doi/10.1016/j.jacc.2012.09.010 2. https://www.jacc.org/doi/10.1016/j.jacc.2017.10.011

# exercise
source: The effect of exercise on blood pressure Exercise has a positive impact on blood pressure and is an important factor in maintaining cardiovascular health and reducing the risk of hypertension. Here are the effects of exercise on blood pressure: 1. Lower systolic and diastolic blood pressure: Aerobic exercise, such as brisk walking, jogging, swimming and cycling, can effectively reduce systolic and diastolic blood pressure. This is because exercise makes the heart pump blood more efficiently and the blood vessels are more flexible, reducing the pressure on the blood vessel walls. 2. Improve heart health: Exercise helps strengthen the heart muscle, making it more powerful to push the blood, reducing the burden on the heart. This can reduce the effort required by the heart in each beat, helping to control blood pressure. 3. Promotes weight control: Exercise is a key factor in maintaining a healthy weight. Too much weight can strain the heart and raise blood pressure. Through regular exercise, you can burn off excess calories and help control your weight, thereby maintaining healthy blood pressure levels. 4. Reduces sympathetic nerve activity: Exercise helps balance the activity of the sympathetic and parasympathetic nervous systems. An overactive sympathetic nervous system can lead to increased blood pressure. Moderate aerobic exercise can reduce this overstimulation and help keep blood pressure stable. 5. Improve insulin sensitivity: Exercise helps to improve the body's sensitivity to insulin and promote the normal regulation of blood sugar. This is helpful for preventing chronic diseases such as diabetes and lowering blood pressure. 6. Reduces stress levels: Exercise releases endorphins and other substances in the body that help relieve stress and anxiety. This is beneficial for lowering blood pressure levels and improving overall mental health. 7. Long-term effect: Continuous exercise habits have a more significant long-term control effect on blood pressure. Regular exercise can make the body gradually adapt to the regulation of blood pressure gradually improve. Before starting any exercise program, especially for people with pre-existing chronic conditions, it is recommended to consult a doctor's advice to develop an exercise program that is appropriate for individual circumstances. Gradually increasing the intensity of exercise and avoiding overexertion are important factors to ensure the positive effects of exercise on blood pressure. Sources of information for the article: 1. https://www.acsm.org/all-blog-posts/certification-blog/acsm-certified-blog/2020/02/11/blood-pressure-hypertension-exercise-cec-course 2. https://www.acsm.org/all-blog-posts/acsm-blog/acsm-blog/2017/12/01/new-high-blood-pressure-guidelines 3. https://members.acsm.org/Shared_Content/ContactManagement/Sign_In.aspx?ReturnURL=/Shared_Content/ContactManagement/SignInRedirect.aspx 4. https://www.acsm.org/news-detail/2019/03/11/featured-certification-blog-exercise-and-hypertension---implications-and-application
ar: تأثير التمارين الرياضية على ضغط الدم ممارسة الرياضة لها تأثير إيجابي على ضغط الدم وهي عامل مهم في الحفاظ على صحة القلب والأوعية الدموية وتقليل خطر ارتفاع ضغط الدم. فيما يلي آثار التمارين الرياضية على ضغط الدم: 1. انخفاض ضغط الدم الانقباضي والانبساطي: ممارسة التمارين الرياضية، مثل المشي السريع، والركض، والسباحة وركوب الدراجات، يمكن أن تقلل بشكل فعال من ضغط الدم الانقباضي والانبساطي. وذلك لأن ممارسة الرياضة تجعل القلب يضخ الدم بكفاءة أكبر وتكون الأوعية الدموية أكثر مرونة، مما يقلل الضغط على جدران الأوعية الدموية. 2. تحسين صحة القلب: تساعد ممارسة التمارين الرياضية على تقوية عضلة القلب، مما يجعلها أكثر قوة لدفع الدم، مما يخفف العبء على القلب. وهذا يمكن أن يقلل من الجهد الذي يتطلبه القلب في كل نبضة، مما يساعد على التحكم في ضغط الدم. 3. يعزز التحكم في الوزن: التمرين هو عامل رئيسي في الحفاظ على وزن صحي. الوزن الزائد يمكن أن يجهد القلب ويرفع ضغط الدم. من خلال ممارسة التمارين الرياضية بانتظام، يمكنك حرق السعرات الحرارية الزائدة والمساعدة في التحكم في وزنك، وبالتالي الحفاظ على مستويات ضغط الدم الصحية. 4. تقلل من نشاط العصب الودي: تساعد ممارسة الرياضة على موازنة نشاط الجهاز العصبي الودي والباراسمبثاوي. يمكن أن يؤدي فرط نشاط الجهاز العصبي الودي إلى زيادة ضغط الدم. التمارين الرياضية المعتدلة يمكن أن تقلل من هذا التحفيز الزائد وتساعد في الحفاظ على استقرار ضغط الدم. 5. تحسين حساسية الأنسولين: تساعد التمارين الرياضية على تحسين حساسية الجسم للأنسولين وتعزيز التنظيم الطبيعي لسكر الدم. وهذا مفيد للوقاية من الأمراض المزمنة مثل مرض السكري وخفض ضغط الدم. 6. تقلل من مستويات التوتر: تعمل التمارين الرياضية على إطلاق هرمون الإندورفين ومواد أخرى في الجسم تساعد على تخفيف التوتر والقلق. وهذا مفيد لخفض مستويات ضغط الدم وتحسين الصحة العقلية بشكل عام. 7. التأثير طويل المدى: عادات التمرين المستمر لها تأثير أكثر أهمية على التحكم في ضغط الدم على المدى الطويل. ممارسة التمارين الرياضية بانتظام يمكن أن تجعل الجسم يتكيف تدريجياً مع تنظيم ضغط الدم ويتحسن تدريجياً. قبل البدء بأي برنامج تمارين رياضية، خاصة للأشخاص الذين يعانون من حالات مزمنة موجودة مسبقًا، يوصى باستشارة الطبيب لوضع برنامج تمارين مناسب للظروف الفردية. تعد زيادة شدة التمرين تدريجيًا وتجنب الإفراط في الإجهاد من العوامل المهمة لضمان التأثيرات الإيجابية للتمرين على ضغط الدم. مصادر المعلومات للمقال: 1. https://www.acsm.org/all-blog-posts/certification-blog/acsm-certified-blog/2020/02/11/blood-pressure-hypertension-exercise-cec-course 2. https://www.acsm.org/all-blog-posts/acsm-blog/acsm-blog/2017/12/01/new-high-blood-pressure-guidelines 3. https://members.acsm.org/Shared_Content/ContactManagement/Sign_In.aspx?ReturnURL=/Shared_Content/ContactManagement/SignInRedirect.aspx 4. https://www.acsm.org/news-detail/2019/03/11/featured-certification-blog-exercise-and-hypertension---implications-and-application
